{"ID": "id_100", "Summary": "The Delhi High Court recently directed the Union of India to file an affidavit within two weeks on why no no objection certificate (NOC) has not been issued to the migrants from Pakistan who are residing without electricity for the last five to six years."}
{"ID": "id_1010", "Summary": "The Allahabad High Court recently stayed the life sentence awarded to a man convicted of murder and sentenced to undergo imprisonment for life under Section 389 of the Indian Penal Code (IPC)."}
{"ID": "id_1019", "Summary": "The Delhi High Court recently held that the amendments brought about in the Copyright Act in 2012 do not have the effect of creating a substantive right in favour of authors of underlying literary and musical works, even if in the form of addition of provisos to Sections 17 and 18 do have the same effect."}
{"ID": "id_1024", "Summary": "The Bombay High Court recently held that the Speaker of the Maharashtra Legislative Assembly is the appropriate constitutional authori ty to decide the question of disqualification under the Tenth Schedule of the Constitution."}
{"ID": "id_1029", "Summary": "The Lucknow bench of the Allahabad High Court on Wednesday directed the Commissioner of Police to refer the case of a man who was allegedly beaten up by police personnel to the Chief Medical Superintendent of KGMU, Lucknow, for further medical examination."}
{"ID": "id_1035", "Summary": "The Supreme Court Collegium on Monday recommended the appointment of Justices S Venkatanarayana Bhatti of the Andhra Pradesh High Court and Ujjal Bhuyan of the Gauhati High Court as judges of the Supreme Court of India."}
{"ID": "id_1036", "Summary": "Therefore, the precise scope of right and extent of restrictions could only be determined upon deeper examination,\" the Court said."}
{"ID": "id_1046", "Summary": "A division bench of Chief Justice of India (CJI) Sanjiv Khanna and Justice Sanjeev Kumar Singh observed that the Central Government may, by rules made under Section 8, provide for the language/languages to be used for the official purpose of the union, including the working of any Ministry, Department, or Office and in making such rules, due consideration shall be given to the quick and efficient disposal of the official business and the interests of the general public and in particular, the rules so made shall ensure that persons serving in connection with the affairs of Union and having proficiency either in “Wherever any letter from a Parliament is in English and the reply is required to be given in Hindi in terms of OL act 1963 and the rules framed under, an English translation should also be sent along with the reply for the convenience of such members from Non Hindi is speaking areas” https://www.mhc.tn.gov.in/judis/ W.P."}
{"ID": "id_1064", "Summary": "The Delhi High Court on Tuesday dismissed a plea filed by a doctor challenging the registration of a criminal case against him under Section 156 of the Indian Penal Code (IPC) for allegedly ill-preserving the left kidney of a patient."}
{"ID": "id_1066", "Summary": "A division bench of Justices Sanjeev Sachdeva and Anuja Prabhudessai held that Section 13(1) of the SHW Act does not require the employer or the District Officer to take action on the basis of the findings of the inquiry conducted by the Inter-Disciplinary Committee (ICC) of the complainant’s department. She had approached the High Court The Delhi High Court on Monday dismissed a plea challenging the constitutional validity of the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Bill, 2018."}
{"ID": "id_109", "Summary": "A Division Bench of Justices Ashutosh Mehta and Ritu Patel held that the selection process was not completed when a decision to reduce the marks was made."}
{"ID": "id_1112", "Summary": "The petitioners had approached the High Court challenging the order of the Davangere Additional District and Sessions Judge, declining them from the array of accused in the case."}
{"ID": "id_1126", "Summary": "The Court further held that section The Supreme Court recently held that the National Company Law Tribunal (NCLT) has the power to decide whether a power purchase agreement (PPA) can be terminated in the event of the initiation of a liquidation proceeding against a corporate debtor."}
{"ID": "id_1131", "Summary": "The High Court recently dismissed a review petition filed by the Municipal Corporation of Greater Mumbai (MCGM) challenging an order passed by a single-judge bench of Justices GS Dharmadhikari and GS Patel on September 17, 2019 directing the MCGM to file a report on the discovery of documents pertaining to more than 4700 leasehold plots in the city."}
{"ID": "id_1133", "Summary": "(For Immediate release) Press Note (High Court of Judicature at Allahabad) Landmark Moment: e-Inauguration of Scanning & Digitization Project of Legacy Case Records of District Courts of Uttar Pradesh AND Online Accessibility of Scanned/ Digitized Case Files of Fresh Cases."}
{"ID": "id_114", "Summary": "The High Court Bar Association had challenged the Order of State Bar Council on the ground that there are serious irregularities in the matters of listing of cases and out of 49 Judges only 12 are allotted work,"}
{"ID": "id_1154", "Summary": "The Orissa High Court recently upheld the decision of the Union Government to rescind the notification establishing the Odisha Administrative Tribunal (OAT) and transfer the cases pending before the OAT to the High Court."}
{"ID": "id_1159", "Summary": "A division bench of Chief Justice of India (CJI) Sanjay Kishan Kaul and Justice Sanjiv Khanna held that since the trial in the instant case was transferred in exceptional circumstances by this Court for limited purpose for trial and disposal to the neighbouring The Gujarat High Court recently quashed the orders of remission passed by the State of Gujarat in the case of a gang rape and murder case."}
{"ID": "id_1166", "Summary": "The Delhi High Court on Monday issued notice to the Union Home Ministry and the Delhi Police on a plea seeking directions to ensure that the proper Covid-19 Protocols are maintained at market places as also by the street vendors."}
{"ID": "id_1169", "Summary": "The Court, therefore, ordered that the suit be set aside and that of the learned Single Judge be maintained 21.Accordingly, the appeal is allowed"}
{"ID": "id_1176", "Summary": "The Court was hearing a petition filed by Chopra challenging the registration of three FIRs (FIRs) against him in connection with the alleged rape of a woman"}
{"ID": "id_1183", "Summary": "The Punjab and Haryana High Court recently convicted a man for raping an eight-year-old girl and sentenced him to life imprisonment."}
{"ID": "id_1189", "Summary": "The Kerala High Court on Wednesday directed the State government to constitute a Medical Board in a government hospital to examine and advise on whether the continuance of the pregnancy would involve risk to the life of the pregnant woman or of grave injury to her mental and physical health."}
{"ID": "id_1191", "Summary": "The petitioner had filed the petition in the High Court on 13.09.2019, that is, after the delay of one day after expiry of a period of three months."}
{"ID": "id_1192", "Summary": "The Registrar had also stated that The Madras High Court recently held that a circular issued by the Collector directing the registering authority to insist upon the No Objection Certificate from the Collector before registration of any document is contrary to the provisions of the Indian Registration Act, 1908 and expressly beyond the powers conferred under Section 69 of the Registration Act."}
{"ID": "id_1193", "Summary": "The Court held that since the deceased son was serving as a conductor in the Maharashtra State Road Transport Corporation (MSRTC), there was no one to look after them and therefore they filed an application for maintenance in Nyayadikari Gram Nyayat."}
{"ID": "id_1194", "Summary": "The Allahabad High Court recently held that it is the Court's discretion to appoint an Advocate Commissioner, who would be willing to undertake the commission."}
{"ID": "id_1199", "Summary": "\"Fundamentally the accused is presumed innocent, but when the trial court confirms his innocence while acquitting the accused, it is a well settled proposition of law that in appeal against the order of acquittal the accused gets double presumption,\" the Court said."}
{"ID": "id_1209", "Summary": "The applicant taking the advantage of the situation, forcibly entered into the house of the informant and threatening to kill the victim, she was dragged to inside the room by grabbing her hair, and forcibly committed rape upon the victim."}
{"ID": "id_1222", "Summary": "The Delhi High Court recently upheld a trial court's order granting bail to 158 persons accused of rioting and assaulting police personnel during a mob attack on a police station in Delhi."}
{"ID": "id_1224", "Summary": "The Court noted that the victim was barely 3 years old at the time of incident and though her examination -in-chief has fully supported the case of prosecution and has levelled serious allegations against the petitioner, no ground for bail is made out at this stage."}
{"ID": "id_1228", "Summary": "A Division Bench of Justices Vijay Tripathi and Deepak Kaushal held that the petitioner was not eligible to apply for direct recruitment as a Judicial Officer/District Judge as she had passed preliminary exams and was practicing as a public prosecutor since 2019."}
{"ID": "id_1239", "Summary": "A Division Bench of Chief Justice of India (CJI) P Sathasivam and Justice P Sathyanarayanan dismissed the plea filed by a petitioner, who contended that Vijayan is holding the post of MLA under Articles 173 (a) and 188 (c) of the Constitution of India, and that the act of the 4th respondent is a clear violation of Article 173(a)."}
{"ID": "id_1243", "Summary": "A division bench of Justices M Venkataramana and M Venkateswara Rao held that the accused had committed an aggravated penetrative sexual assault against the victim girl, who was below 12 years of age on the date of offence."}
{"ID": "id_1253", "Summary": "\"Thus the finding of guilt of the two accused appellants recorded by the two Courts below is based on sole testimony (PW-1),\" the Court said."}
{"ID": "id_1258", "Summary": "The Court also directed the accused to appear before the Investigating Officer between 10.00 am and 11.00 am every Saturday until the final report"}
{"ID": "id_1260", "Summary": "The Court noted that the petitioner's matrimonial life had completely changed during the course of the pregnancy and that her husband had refused to accompany her to the hospital to undergo the medical termination."}
{"ID": "id_128", "Summary": "The Delhi High Court on Wednesday directed the Delhi Medical Council (DMC) to ensure that such mushrooming salons carrying hair transplantation procedures under unprofessional hands without requisite qualification and in absence of medical supervision, are checked."}
{"ID": "id_1281", "Summary": "\"The gravity of the offence is on the face of the record as a young lady of aged 32 years, who was a mother of a child of 4 years age has died by committing suicide who, as alleged has been a constant victim of physical and mentally torture on account of demand of dowry by mother - in-law (applicant here in), husband and brother -in- law and she finally ended her life by suicide"}
{"ID": "id_1290", "Summary": "The Kerala High Court recently allowed medical termination of the pregnancy of a 15-year-old girl who was allegedly raped by her father."}
{"ID": "id_1296", "Summary": "The Delhi High Court recently ordered a woman to pay a fine of Rs.1 lakh for demolishing a boundary wall constructed by her in violation of an order passed by the Court."}
{"ID": "id_1303", "Summary": "The Court was hearing a special leave petition filed by the father challenging an order of the Family Court rejecting his application for interim custody of his son, Charvik."}
{"ID": "id_1308", "Summary": "The Allahabad High Court recently dismissed an appeal filed by a man against a Sessions Court order rejecting his bail plea in a rape case."}
{"ID": "id_1314", "Summary": "\"The investigation qua the appellant is complete and further investigation is kept open on the basis of the allegations made against the appellant,\" the Court The constitutional validity of certain provisions of the PML Act and the procedure followed by the Enforcement Directorate while inquiring into/ investigating offences under the said Act having been challenged before this Court in case of Vijay Madanlal Choudhary and Others vs."}
{"ID": "id_1317", "Summary": "The Uttarakhand High Court on Wednesday directed the Haridwar District Magistrate to inquire into the reasons behind the delay in processing an application for conversion of a Muslim woman to Hinduism."}
{"ID": "id_1328", "Summary": "The Madras High Court recently directed the Reserve Bank of India (RBI) to sanction and disburse an educational loan of Rs.4,07,200 to a student who was rejected by the bank on the basis of his parents' unsatisfactory credit score."}
{"ID": "id_136", "Summary": "A division bench of Justices Sanjiv Khanna and Anuja Prabhudessai dismissed the plea filed by a group of Rohingyas seeking direction to Facebook and other social media platforms to restrain them from posting objectionable content on their platforms."}
{"ID": "id_1367", "Summary": "The Court also held that there is no provision in the Act that confers any other provision of the Act with a function of laying down pre The Supreme Court on Thursday held that the Bar Council of India (BCI) has the power to make rules determining the seniority among advocates under Section 49(1)(ae) of the Advocates Act, 1961."}
{"ID": "id_1374", "Summary": "The Supreme Court Collegium recommended the names of the Advocates for appointment as Judges in the High Court of Gujarat in the following terms: The Collecium of the High court of Gujarat comprising of the then Chief Justice and two senior -most Judges unanimously made the recommendation on 26 September 2022."}
{"ID": "id_138", "Summary": "The Court was hearing a public interest litigation (PIL) filed by the National Alliance for People's Welfare (NAPWAW) seeking directions from the High Court to the state government to implement preventive measures to ensure the safety and welfare of the pilgrims and the premises at and The Calcutta High Court on Tuesday directed the West Bengal government to file an affidavit in the form of an affidavit by a Medical Officer at the highest level in the State Government service, clearly delineating the modalities of preventive management of the situation if Ganga Sagar Mela is permitted to be held this year."}
{"ID": "id_1383", "Summary": "\"Having regard to the above aspects, the collegium is of the considered opinion that the candidate belongs to the Ba r and has been practising in seventy five cases resulting in the appointment as a judge of the Madras High court,\" the Bench said in its order."}
{"ID": "id_1390", "Summary": "The Court was hearing a public interest litigation (PIL) filed by a resident of Bijnor seeking directions to the State Government to provide better health care facilities in rural areas."}
{"ID": "id_1392", "Summary": "\"It is clear from the facts that during the pendency of The Bombay High Court recently held that a magistrate's refusal to grant default bail to an accused under Section 167(2) of the Code of Criminal Procedure (Cr.PC) is not maintainable."}
{"ID": "id_1399", "Summary": "The notification stated that the President has appointed Justice Manidra Mohan ShriVASTAVA as the next Chief Justice (CJ) of Rajasthan High"}
{"ID": "id_140", "Summary": "A division bench of Chief Justice P Sathasivam and Justice S Vijayakumar said that the circular was in gross breach of the Constitution's fundamental right to freedom of speech."}
{"ID": "id_1402", "Summary": "The Punjab and Haryana High Court recently held that a woman's death by way of suicide is a clear case of dowry death under the Indian Penal Code (IPC)."}
{"ID": "id_1404", "Summary": "The Delhi High Court recently held that the appointment of a Commissioner of Police (CPO) is akin to the post of DGP of the State and therefore directions in Prakash Singh’s Case (I) and (II) of the Honble Supreme Court are required to be followed by the Central Government while making an appointment to the said post."}
{"ID": "id_1425", "Summary": "The Bombay High Court recently granted bail to Sharjeel Imam, who was arrested in connection with a case of rioting and destruction of public property."}
{"ID": "id_143", "Summary": "The Court was hearing a petition filed by Kharat challenging the order passed by the Additional Sessions Judge (ASJ) who had granted him interim protection from arrest in connection with the case."}
{"ID": "id_1455", "Summary": "The Bombay High Court recently granted interim relief to the owners and managers of the Republic TV channel in connection with a criminal case registered against them by the Maharashtra Police for allegedly violating the Model Code of Conduct (MCC)."}
{"ID": "id_1458", "Summary": "The President of India has appointed Justice Aparesh Kumar Singh, Judge of the Jharkhand High Court, as the Chief Justice of the Tripura High Court with effect from the date he assumes charge of his office."}
{"ID": "id_1460", "Summary": "A division bench of Justices Sanjeev Sachdeva and Ashutosh Kumar passed the order while hearing a Public Interest Litigation (PIL) filed by a group of doctors seeking directions to the Ministry of AYUSH and the Central Council for Research in Homeopathy (CCRH) to allow homoeopathy practitioners to treat mild cases of Various status reports have been filed from time to time and the fact remains that at the relevant point of time when the Writ Petition was filed, the infection rate of COVID -19 was very high"}
{"ID": "id_1464", "Summary": "The Bombay High Court on Wednesday allowed a petition challenging the constitutional validity of the National Green Tribunal (NGT)."}
{"ID": "id_1466", "Summary": "The Bombay High Court recently directed the Maharashtra government and the Brihanmumbai Municipal Corporation (BMC) to complete an exercise to provide relief and respite to physically challenged persons working in the State Government/Corporation and visiting the offices of the State government and Corporation within a period of eight weeks."}
{"ID": "id_1481", "Summary": "On the aspect of the Respondent suffering from HIV, the Petitioner has deposed that the HIV positive result of the respondent has caused the Petitioner mental agony,\" the Court said."}
{"ID": "id_1492", "Summary": "The father of the deceased, Suresh Devi, had alleged that his son was murdered in the custody of the police in the night intervening December 11 and 12."}
{"ID": "id_1503", "Summary": "The Allahabad High Court on Tuesday directed the Uttar Pradesh government to take suitable action against eateries which are found to be violating the guidelines issued by the Central government and the State government in relation to the outbreak of Influenza A (H1N1)."}
{"ID": "id_1519", "Summary": "The Delhi High Court on Tuesday granted bail to Tahir Hussain, a man accused of instigating a mob to attack a Hindu temple in Delhi's Karkardooma area in November last year."}
{"ID": "id_152", "Summary": "The Court also directed the Investigating Officer (IO) to inform the Court within seven days from today whether a case has been registered on"}
{"ID": "id_1530", "Summary": "The father had allegedly raped his daughter on January 9, 2021 at PS Meharuali South under Section —For the purposes of clause (a), where any pregnancy occurs as a result of f ailure of any device or method used by any woman or her partner for the purpose of limiting the number of children or preventing pregnancy, the anguish caused by such pregnancy may be presumed to constitute a grave injury to the mental health of the pregna nt woman."}
{"ID": "id_154", "Summary": "The Allahabad High Court recently quashed a First Information Report (FIR) registered by the Hapur Dehat police against four persons for allegedly defrauding an oil company of Rs.1929,135."}
{"ID": "id_1571", "Summary": "The Allahabad High Court recently directed the State of Uttar Pradesh to pay a lump sum amount of Rs.50,000 to a woman lawyer who was forced to approach the High Court as her bills for the period from December, 2009 to December, 2017 were kept pending by the State."}
{"ID": "id_1588", "Summary": "The Delhi High Court recently held that the mother is entitled to custody of her male child until that child completes the age of 7 years under the Sunni School of Mohammedan law and 2 years under Shia School of Mohammadan law."}
{"ID": "id_1590", "Summary": "The Delhi High Court recently quashed an FIR registered by the Delhi Police against a group of people for allegedly assaulting a police officer."}
{"ID": "id_1606", "Summary": "The Madras High Court recently held that any patient is entitled to a civil and courteous treatment at the hands of all the staff including doctors in a government hospital."}
{"ID": "id_1614", "Summary": "A Bench of Justices Adarsh Kumar Goel and Sanjeev Sachdeva held that the provisions of Section 37 of the Narcotic Drugs"}
{"ID": "id_1620", "Summary": "The Delhi High Court recently directed the University of Delhi (DU) to issue its online digital degree certificates on or before October 5, 2020."}
{"ID": "id_1622", "Summary": "A division bench of Justices Sanjiv Deshmukh and Shailesh Mahajan held that there is prima facie case made out against each of the applicants, inspite of their sometimes residing away from the place where non-applicant no."}
{"ID": "id_1634", "Summary": "The order was passed on a plea moved by advocate Ramesh Kumar Pandey, who claimed that the lady Judicial Officer was in family way and her safety was seriously threatened by the contemnor."}
{"ID": "id_1659", "Summary": "The Delhi High Court on Monday rejected the plea of Aam Aadmi Party (AAP) leader Manish Sisodia seeking quashing of a criminal complaint filed by the Central Bureau of Investigation (CBI) against him for alleged offences under the Prevention of Money Laundering Act (PML Act)."}
{"ID": "id_1671", "Summary": "A division bench of Justices Ajay Kumar and Ajay Yagnik was hearing a public interest litigation (PIL) filed by the Gujarat Advocates’ Association (GAA) seeking directions to the State Government"}
{"ID": "id_1675", "Summary": "A division bench of Justices Abhay Oka and Ashutosh Deshmukh set aside the order and directed the State Government to constitute a new committee within eight weeks from today in accordance with the provisions of section 5 of the Maharashtra Control of Organised Crime Act, 2004 and in line with the principles laid down by the Supreme Court in the judgments referred to in the case of Sachin Pawar v."}
{"ID": "id_170", "Summary": "Since the court did not delve into that The Bombay High Court on Wednesday directed the Central Bureau of Investigation (CBI) to initiate a preliminary enquiry into a complaint filed by former Maharashtra Home Minister Anil Deshmukh alleging that he was pressurised by the then Home Minister Chhagan Bhujbal to order the transfer and postings of police officers."}
{"ID": "id_1715", "Summary": "A division bench of Justices Anju Bajaj Chandna and Rajesh Yadav observed that the order of the Family Court reflected poorly in the manner in which the Court has conducted itself."}
{"ID": "id_1718", "Summary": "The trial court did not appreciate that the physical meeting between A1, A3, A8, A11 and A12 at Although the defence sought to discredit his testimony by pointing to inconsistencies in his version Crl.A.Nos.172, 174, 176, 177, 178, 179, 180, 339 :: 114 ::& 403/2014 & CRA(V).No.571/2015 as regards his involvement as a witness against a CPI (M) worker in another case (S.C.595/2012) as evidenced in Exts.D1 and D2 documents produced by the defence, we are of the view that his testimony is believable especially because he did not choose to hide the fact that he was an active worker of the RMP and that he had attended the inquest of T.P."}
{"ID": "id_1737", "Summary": "“This Court is a bit disturbed given today’s headline in 'Indian Express' of 14-07-21 about the 'Kanwar yatra'."}
{"ID": "id_1739", "Summary": "The Delhi High Court recently quashed an order passed by an Additional Civil Judge, Gautam Budh Nagar, under Section 31(1) of the Protection of Women from Domestic Violence Act, 2005 (PWDV Act) for non-compliance of an order of monetary relief or interim maintenance order in a criminal case."}
{"ID": "id_1744", "Summary": "The Indore bench of the Madhya Pradesh High Court recently quashed an order passed by the Additional District Magistrate (ADM) of Indore, who had dismissed an application filed by a company seeking possession of a property in the name of its customers."}
{"ID": "id_1760", "Summary": "The Supreme Court on Thursday held that mere membership of a banned organization will not incriminate a person unless he resorts to violence or incites people to violence and does an act intended to create disorder or disturbance of public peace by resort to violence meaning thereby over and above the membership of the banned organization there must be a mens rea required to be established and proved. A bench of Chief Justice of India Dipak Misra and Justices AM Khanwilkar and DY Chandrachud was hearing a plea challenging the constitutional validity of Section 10(a)(i) of the Unlawful Activities (Prevention) Act (UAPA) which makes it an offence for a person to be a member of any banned organization. The Court said that while deciding the cases of Arup Bhuyan (Supra) and Raneef (supra), the Court has followed the US Supreme Court decisions on freedom of speech and on mere membership without any criminality and/or overt act and mere membership be said to have committed an offence or not."}
{"ID": "id_1766", "Summary": "The Bombay High Court recently rejected a woman's claim that she belongs to the \"Tokre Koli\" caste, observing that the caste is mentioned in the birth register of the school where she was admitted as a child."}
{"ID": "id_1769", "Summary": "The Delhi High Court on Wednesday issued guidelines to ensure that the media and the public are not allowed to record or transcribe any part of the proceedings of any court proceedings."}
{"ID": "id_1772", "Summary": "\"For the reasons already recorded by this Court, this Court is of the view that exclusively reservation conferred on women while in recruiting \"Nursing Officers\" under Ordinance, 1942 does violate Article 16(2),\" the Court said."}
{"ID": "id_1778", "Summary": "Justice Krishan Chander Sharma passed the order on a plea filed by Suresh Verma, his wife Ramu Lal Balai and their son Puran Mal Verma challenging an order passed by a single-judge bench of the High Court on August 10, which had directed the Sikar Police to grant police protection to the couple."}
{"ID": "id_1782", "Summary": "The Bombay High Court recently quashed a deportation order issued by the Central Bureau of Investigation (CBI) against an Indian woman for allegedly violating the terms and conditions of the E-Visa."}
{"ID": "id_1786", "Summary": "\"The right to free speech, which is given to the petitioner, cannot be curbed by the respondents [the State of Rajasthan and the Union of India] by taking any recourse to this action,\" the Court said."}
{"ID": "id_1793", "Summary": "In its decision, the Court noted that the licensee had previously been found to have breached the UK Broadcast Advertising Rules (Broadcast Ad Rules) by broadcasting an episode of Peace The Court of Appeal has upheld Ofcom’s decision not to impose a financial penalty on Worldview Media Network Limited (the “ Licensee” or “Worldview”) in relation to its broadcast of a programme in which a presenter referred to members of the Pakistani community as “Bharat people” and “Pakistani people”."}
{"ID": "id_1802", "Summary": "A division bench of Justices Rajesh Kumar Singh and Ujjwal Nikam granted bail to Mohammad Nadeem, who was arrested by the Uttar Pradesh Police on September 28, on the ground that he is an active member of PFI."}
{"ID": "id_1803", "Summary": "The Court was hearing a petition filed by the farmers seeking directions to the MPCB to take steps to curb pollution in Madhya Pradesh."}
{"ID": "id_1809", "Summary": "The Court was hearing a petition filed by the couple seeking protection against the threat of death or physical harm to them by their parents and relatives."}
{"ID": "id_1827", "Summary": "The Madras High Court recently held that a Muslim woman has the right to terminate her marriage at her own will."}
{"ID": "id_1843", "Summary": "A division bench of Chief Justice of India (CJI) Sanjiv Khanna and Justice P Sathyanarayanan passed the order while hearing a petition filed by the girl's adoptive parents challenging the order of the Guardian Judge of Ludhiana, Punjab, who had granted the girl an adoption order in November 2018."}
{"ID": "id_1860", "Summary": "The Allahabad High Court on Monday refused to grant anticipatory bail to a man accused of molesting a minor girl, observing that the matter is of very serious nature, hence the bail application moved by the accused deserves to be cancelled."}
{"ID": "id_1877", "Summary": "A division bench of Justices M.K.M.Firoz and P.Paul observed that if the parties do not make a request for publication of notice in writing, while giving notice under Section 5 of the Act, the Marriage Officer shall not publish any such notice or entertain objections to the intended marriage."}
{"ID": "id_1878", "Summary": "The Court was hearing a plea filed by the CJI challenging the constitutional validity of the Central Administrative Rules, 2020 (2020 Rules)."}
{"ID": "id_19", "Summary": "The Madras High Court recently directed the Tamil Nadu government to award marks and consider the petitioner for appointment to the posts included in the Combined Civil Services Examination-II Group II Services within the time stipulated by the Court."}
{"ID": "id_192", "Summary": "The National Consumer Disputes Redressal Commission (NCDRC) has directed a hair salon to pay a compensation of 2,00,00,000 to a woman who claimed to have suffered loss of her hair due to the salon's negligence."}
{"ID": "id_198", "Summary": "A division bench of Justices Ashutosh Deshmukh and Anuja Prabhudessai dismissed the petition filed by Ramhari Dagadu Shinde and Ramhari Ors, who were appointed to the posts of Chairman and Members of the Commission respectively on June 20, 2023."}
{"ID": "id_20", "Summary": "The petitioner in the writ petition has also pleaded that the State of Punjab and NCT of Delhi which had earlier issued directions for affixing poster outside the residence of Covid-19 positive patients have withdrawn the said orders and now no posters are being pasted on the outside of the houses of the COVID 19 positive persons."}
{"ID": "id_201", "Summary": "The Department of Justice has forwarded the above recommendation by invoking Para 14 of the"}
{"ID": "id_213", "Summary": "A division bench of Justices P Sathyanarayanan and P Vijayakumar observed that the Court of Session had found that the accused were not aware that the infant was alive when they disposed of the body of her in the sea."}
{"ID": "id_223", "Summary": "The man had moved the Railway Claims Tribunal (RTT) seeking compensation for injuries sustained due to accidental fall from the train."}
{"ID": "id_226", "Summary": "A Division Bench of Justices Manmohan Singh and Gurmeet Ram Rahim Singh held that Section 72 of the Punjab Reorganisation Act, 1966 and Sections 3 and 4 of the Inter-State Corporation Act, 1957 were transitional provisions to meet the immediate requirement of the issues arising out of creation of a separate State."}
{"ID": "id_227", "Summary": "The Kerala High Court recently held that reappointment of a vice-chancellor is permissible under the University Grants Commission (UGC) Regulations."}
{"ID": "id_230", "Summary": "The Bombay High Court recently held that a husband cannot be held liable for his wife's maintenance if he fails to discharge his obligation under Section 125 of the Code of Civil Procedure (CrPC)."}
{"ID": "id_237", "Summary": "The Delhi High Court on Monday dismissed a plea seeking a direction to the Delhi government to pay a compensation of Rs 1 crore to a woman who was allegedly raped by a man."}
{"ID": "id_238", "Summary": "\"On a perusal of the order impugned, it thus appe ars that there is a contradiction in the order that was passed by the Court below dealing with the Cyber offences,\" the Court said."}
{"ID": "id_239", "Summary": "The Bombay High Court recently held that a woman who claims to have been subjected to cruelty by her husband is not entitled to a divorce under the Hindu Marriage Act (HMA)."}
{"ID": "id_247", "Summary": "The Punjab and Haryana High Court on Tuesday granted liberty to a man who was nominated as an accused in a case related to the violence that broke out in Haryana's Nuh district on July 30."}
{"ID": "id_255", "Summary": "The order was passed after the counsel appearing for the petitioner informed the court that the situation had worsened due to the recent outbreak of Covid- 19 pandemic since the last one week."}
{"ID": "id_259", "Summary": "The Calcutta High Court recently directed the State of West Bengal to pay a minimum compensation of Rs 6 lakh to the sisters of a woman who was allegedly acid-attacked by her husband. The Court was hearing a plea filed by the victim and her brother seeking compensation under the National Legal Services Authority (NALSA)'s Compensation Scheme for Women Victims/Survivors for Sexual Assault/other Crimes, 2018."}
{"ID": "id_269", "Summary": "After PW-7 went to the terrace and it is thereafter, that PW-7 claims that the Appellant had sexually abused her,\" the Court said."}
{"ID": "id_304", "Summary": "The Punjab and Haryana High Court recently upheld the decision of the Disciplinary Committee of the Paralympic Committee of India (PCI) to debar a para-swimmer for three years for allegedly abusing the Chairman and other office bearers of the committee."}
{"ID": "id_315", "Summary": "A division bench of Justices Sanjeev Sachdeva and Sanjiv Kumar Singh passed the order while hearing a plea filed by a woman who alleged that she was raped by five persons in December 2018."}
{"ID": "id_317", "Summary": "The Delhi High Court recently granted bail to two persons, who were arrested under the Narcotic Drugs and Psychotropic Substances Act (NDPS Act) in a case related to the seizure of a large quantity of heroin from a Delhi-bound train."}
{"ID": "id_333", "Summary": "The Delhi High Court recently quashed a First Information Report (FIR) registered against a Muslim man for allegedly raping a minor girl who was a minor at the time of the alleged incident."}
{"ID": "id_355", "Summary": "The Delhi High Court recently held that a lawyer cannot claim privilege with respect of a professional communication made to him by his client, unless he has his client's express consent to disclose, in the absence of any such consent."}
{"ID": "id_357", "Summary": "The Delhi High Court recently held that a remittance of Rs 15.53 crore received from the Justices and Education Fund (JEF) was not genuine."}
{"ID": "id_36", "Summary": "A Bench of Justices AS Bopanna and Ashutosh Deshmukh said that the trial Court had given undue importance to the testimony of a witness, who had identified the accused on the basis of the interrogation of the other accused."}
{"ID": "id_377", "Summary": "\"It is to be noted that the child victim has consistently stated in her testimony as well as various previous statements that she was touched in the Anal region by the appellant and the touch caused her pain,\" the Court said."}
{"ID": "id_416", "Summary": "The Rajasthan High Court on Tuesday quashed a criminal case registered against Bollywood actor Shubham Modi and his wife Sushmita Sen in connection with a money laundering case."}
{"ID": "id_422", "Summary": "A division bench of Chief Justice of India (CJI) Sanjeev Sachdeva and Justice Sanjiv Khanna passed the order while hearing a petition filed by the woman, who alleged that her family members were falsely implicated in a false case registered against them by the police."}
{"ID": "id_423", "Summary": "The Kerala High Court on Thursday directed the Family Court to release the amount deposited towards arrears of maintenance within three days, without fail and report the same to the Registrar of Family Court."}
{"ID": "id_434", "Summary": "The Calcutta High Court recently held that the West Bengal School Service Commission (WCBSC) has the right to start the selection process for the post of Non-Teaching Staff (NTS) on the date of advertisement. A division bench of Chief Justice of India (CJI) Sanjeev Sachdeva and Justice Sanjiv Goswami made the observation while setting aside an impugned memo of the Additional District Inspector of Schools (SE), Purba Medinapur dated July 3, 2020. The order was passed on a plea filed by a woman who had applied for the NTS post on the basis of marks obtained in her class VIII examination."}
{"ID": "id_436", "Summary": "This petition coming on for admission upon perusing the petition and the affidavit filing in support of WP (C) and upon hearing the arguments of petitioner and GOVERNMENT PLEADER for R3, the court passed the following: Dated this the 17 th day"}
{"ID": "id_469", "Summary": "The Court was hearing a petition filed by the complainant against Khanna, who was the Editor in Chief of India Today at the time of the alleged publication of the article."}
{"ID": "id_470", "Summary": "The Delhi High Court on Tuesday dismissed the bail plea of former Delhi Deputy Chief Minister Manish Sisodia in a money laundering case filed by the Enforcement Directorate (ED) against him."}
{"ID": "id_490", "Summary": "The Allahabad High Court on Monday stayed the operation of an order passed by a District Judge directing the recounting of votes in a local body election in Uttar Pradesh."}
{"ID": "id_505", "Summary": "The Court was hearing a petition filed by the Managing Members of the Sarad Mutt, Ammal, seeking quashing of the order passed on May 23, 2018 by the single judge bench."}
{"ID": "id_524", "Summary": "The Bombay High Court on Tuesday granted bail to a suspended Indian Forest Service (IFS) officer who was accused of murdering his wife and then committing suicide."}
{"ID": "id_541", "Summary": "The Court also said that there was no allegation that the 17 appellants promised to marry the complainant and it was done in bad faith or with the intention to deceive her."}
{"ID": "id_560", "Summary": "The Court noted that the Assistant Controller appeared to be “thoroughly confused both as to the nature of the claim for which the application was made as well as objections raised in the FER and in the notice of hearing” and that the order “cannot be said to satisfy even the most fundamental requisites of an order"}
{"ID": "id_57", "Summary": "The Hyderabad High Court recently quashed a criminal case registered against a company and its directors in connection with the alleged sale of fake goods."}
{"ID": "id_573", "Summary": "A Division Bench of Chief Justice (CJ) Sanjay Kishan Kaul and Justice (Retd) Ajay Kumar Sharma held that the service conditions relied upon by the petitioner are not mandatory in nature, more particularly when the appointment of the petitioner was contractual."}
{"ID": "id_577", "Summary": "The High Court recently quashed an FIR registered against former Chief Minister Anandiben Patel for her alleged complicity in the 2002 Gujarat riots."}
{"ID": "id_578", "Summary": "The Bench noted that the Supreme Court in Union of India v State of India (2017) 5 SCC 702 had already settled that The Allahabad High Court on Wednesday directed the Bar Council of Uttar Pradesh to ensure that lawyers abstain from work even if any family member of an advocate dies or for various other reasons totally unconnected with the profession."}
{"ID": "id_582", "Summary": "A division bench of Justices Sanjay Kishan Kaul and Ashutosh Kumar said that the evidence collected by the investigating agency against the applicant links him with proceeds of crime to the extent of Rs."}
{"ID": "id_592", "Summary": "\"Though the antecedent alone is not a ground of rejecting or accepting a bail, but it is must that the Hon'ble High Court should have the antecedent report to check the applicability of Section 437 (1) of Cr.P.C."}
{"ID": "id_596", "Summary": "A bench of Chief Justice of India (CJI) DY Chandrachud and Justice Rajiv Shakdher said that if one party's conduct is such as may satisfy the conscience of the Court, the relationship cannot be irretrievably broken down."}
{"ID": "id_609", "Summary": "The Supreme Court recently held that an application seeking vacation of an interim order passed by a lower court cannot be an act of omission or commission. A Bench of Justices AM Khanwilkar and DY Chandrachud held that the application for vacation of the interim order is mandatory only by the party who had not furnished a copy of the petition nor given the opportunity to be heard when the stay order was passed."}
{"ID": "id_612", "Summary": "The Delhi High Court on Tuesday directed the Election Commission of India (ECI) to lay down guidelines to govern the process of selection and removal of Chief Election Commissioner and Election Commissioners, till the Legislature steps in."}
{"ID": "id_618", "Summary": "The Delhi High Court on Monday dismissed a plea challenging the validity of the Delhi High court's decision to grant interim relief to the Delhi government in the case of the death of former Delhi Chief Minister Sheila Dikshit."}
{"ID": "id_619", "Summary": "\"The petitioner seeks a direction to the Commissioner of Police to restrain him from registering FIRs alleging the commission of offence under Section 4, of the aforesaid Act during the pendency of the writ petition."}
{"ID": "id_622", "Summary": "The Supreme Court Collegium on Monday recommended the appointment of Justice Prasanna Bhalachandra Varale as a judge of the Supreme Court of India."}
{"ID": "id_638", "Summary": "A bench of Chief Justice of India (CJI) Sanjay Kishan Kaul and Justices Alok Aradhe and Ashutosh Kumar said that the petitioner was an Advocate and thus was supposed to be well versed in law."}
{"ID": "id_644", "Summary": "A division bench of Justices S Ravindran and S Venkatachalam passed the order while hearing an appeal filed by a man against a divorce decree passed by the Family Court in May 2017."}
{"ID": "id_654", "Summary": "In the matter of Habeas Corpus petitions, the corpus shall be produced by jurisdictional police authorities before the jurisdictional District Court to enable the Honble Judges presiding the Bench to interact in virtual mode with the persons"}
{"ID": "id_676", "Summary": "The court was hearing a public interest litigation (PIL) filed by advocate Bhaskar Prasad Banerjee, challenging the police action against the protesters who had taken to the streets on June 10."}
{"ID": "id_683", "Summary": "The Delhi High Court recently held that the Foreign Contribution Regulation Act (FCRA) of 2010 (Amendment) Act, 2020 (Amendment Act 2020) was not violative of Articles 14, 19(1)(c), 19(1)(g) and 21 of the Constitution of India insofar as it requires opening of primary FCRA account in State Bank of India (SBI) and National Development Microfinance Bank (NDMB) only."}
{"ID": "id_69", "Summary": "The Bombay High Court recently held that a person can be charged under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989 (SC and ST Act) only if he or she is a member of a Scheduled Tribe or a Scheduled Caste."}
{"ID": "id_691", "Summary": "A division bench of Justices Jayanta Sengupta and Shounak Ghosh held that the order passed under Section 144 of the Code of Criminal Procedure (CrPC) was “malicious” and “meant to prevent the petitioner from holding political rally”."}
{"ID": "id_692", "Summary": "The Bombay High Court recently held that the time limit of six months prescribed in the two provisos to section 9-A of the Maharashtra Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 2000, within which an elected person is required to produce the Validity Certificate from the Scrutiny Committee is mandatory."}
{"ID": "id_701", "Summary": "A bench of NHRC Chairperson Justice Sanjeev Sachdeva and Justice Sanjiv Khanna said that the question paper for CSAT was set up by a committee of experts and their wisdom and knowledge cannot be questioned in a legal forum through judicial review."}
{"ID": "id_703", "Summary": "The Madhya Pradesh High Court on Wednesday directed the District Magistrates of all nine districts falling within the territorial jurisdiction of this Court to restrain any candidate/political party from holding physical congregations of any number of people unless the political party applying for such a congregation is able to satisfy the District Magistrate concerned that conduction of virtual election campaign is not possible."}
{"ID": "id_706", "Summary": "The President has also appointed Justice Sanjay Vashisth, Justice Naresh Singh, Justice Harsh Bunger, Justice Jagmohan Bansal, Justice Deepak Manchanda, Justice Alok Jain, Justice Harkesh Manuja and Justice Aman Chaudhary as Additional Judges of the Court."}
{"ID": "id_729", "Summary": "The Bombay High Court recently held that the presence of a child at the time of hearing of an application seeking release of an accused in a sexual assault case does not interfere with the rights of the child or his family to participate in the proceedings. A division bench of Justices Abhay Oka and Alok Aradhe made the observation while disposing of a petition filed by the Maharashtra State Public Prosecutor (SJPU) challenging a single-judge order of the High Court directing the SJPU to issue notices of hearing to the child's family, guardian or legal counsel."}
{"ID": "id_732", "Summary": "The Patna High Court recently held that a minor female child is a child as defined by Section 2(d) of the Protection of Children from Sexual Offences Act (POCSO Act)."}
{"ID": "id_733", "Summary": "\"Since the Parliament has left the matter to the judgment of the Central Government without prescribing any objective norms, it makes it difficult for the Courts to substitute their own judgment for that of The Madras High Court recently declared that the first proviso to Section 184 of the Tribunal Reforms (Rationalisation and Conditions of Service) Ordinance, 2021 is void and inoperative."}
{"ID": "id_734", "Summary": "The counsel for the petitioner argued that the email purportedly terminating the partnership was sent by the firm's managing partner to the petitioner on October 13."}
{"ID": "id_740", "Summary": "A division bench of Chief Justice of India (CJI) Sanjiv Khanna and Justice Sanjeev Kumar Mishra noted that the second respondent had been convicted of an offence punishable under Section 302 of the Indian Penal Code (IPC) and sentenced to suffer imprisonment for life."}
{"ID": "id_743", "Summary": "The Bombay High Court on Monday granted bail to Hasan Sk., one of the accused in the case registered against him by the Mumbai Police."}
{"ID": "id_744", "Summary": "A division bench of Justices Abhay Oka and Ashutosh Deshmukh held that the girl was sufficiently mature to be conscious of the relationship, both physical and mental, and merely because, the relationship had now turned sour, it cannot be inferred that the physical relationship established with her, on every occasion, was against her will and without her consent."}
{"ID": "id_748", "Summary": "A division bench of Chief Justice of India (CJI) Sanjiv Khanna and Justice Sanjeev Kumar Singh dismissed the complaint filed by a member of the minority community, Abdul Khaleque."}
{"ID": "id_773", "Summary": "The Delhi High Court on Tuesday dismissed a plea seeking a direction to the Union of India and the Delhi Development Authority (DDA) to stop the ongoing construction activity in connection with the Central Vista Avenue Redevelopment Project (CVR Project) in New Delhi."}
{"ID": "id_774", "Summary": "A division bench of Chief Justice of India (CJI) Sanjay Kishan Kaul and Justice Sanjeev Sachdeva dismissed the plea filed by the firm, Rectification Petitions Group Co."}
{"ID": "id_78", "Summary": "The Punjab and Haryana High Court recently held that the Haryana State Employment of Local Candidates Act, 2020 is unconstitutional and violative of Article 19 of the Constitution of India and Article 19(5) of the Indian Constitution."}
{"ID": "id_781", "Summary": "The Jammu and Kashmir High Court on Monday granted interim relief to a woman activist who was booked for allegedly posting a picture of a burning effigies of the Prophet Mohammed on social media."}
{"ID": "id_782", "Summary": "\"In view of Section 45 of the PMLA, the petitioner being sick or infirm is entitled to be admitted to bail,\" the Court said."}
{"ID": "id_79", "Summary": "The Delhi High Court recently quashed the registration of a First Information Report (FIR) in a case of rape and sexual assault on the ground that the complainant had filed a complaint only on June 25, 2018 and the police had not submitted a final report."}
{"ID": "id_793", "Summary": "A division bench of Justices Abhay Oka and Ashutosh Deshmukh said that there was sufficient material available against the accused to show that they were involved in the activities of the banned organisation."}
{"ID": "id_8", "Summary": "The Supreme Court on Tuesday struck down the upper age limit for availing assisted reproductive technology (ART) services prescribed under Section 21 (g) of the Assisted Reproductive Technology (Regulation) Act. A bench of Chief Justice of India Ranjan Gogoi and Justices DY Chandrachud and Indu Malhotra held that the upper limit of 55 years for men and 50 years for women is irrational, arbitrary, unreasonable and violative of their right to reproduction, acknowledged as a fundamental right."}
{"ID": "id_804", "Summary": "The Madhya Pradesh High Court recently held that allocation of a coal block made in form of the petitioner did not run foul of the procedure prescribed in the Mines and Minerals Development Rules (MMDR) Act and the Madhya Pradesh Mining Rules (MC Rules)."}
{"ID": "id_808", "Summary": "The Court was hearing a petition filed by the news channel challenging the order passed by a single-judge bench of the High Court in the case of accused Nupur Sharma, who was The Delhi High Court recently quashed two FIRs registered against Times Now anchor Navika Kumar in connection with the Newshour Debate telecasted on May 26, 2022."}
{"ID": "id_817", "Summary": "The Bombay High Court on Tuesday dismissed a criminal contempt plea filed by a woman against the Chief Justice of India (CJI) for allegedly making \"scandalous remarks or comments\" against the dignity and majesty of the Supreme Court."}
{"ID": "id_84", "Summary": "However, the inherent power or the extra-ordinary power conferred upon the High Court, entitles the said Court to quash a proceeding, if it comes to the conclusion that allowing the proceeding to continue would be an abuse of the process of the Court, or the ends of justice require that the proceeding ought to be quash"}
{"ID": "id_843", "Summary": "The Bombay High Court recently directed the State of Maharashtra to pay compensation to the widow of a man who was killed by a wild boar in Ratnagiri district of Maharashtra in September 2022."}
{"ID": "id_85", "Summary": "A division bench of Chief Justice Manjula Chellur and Justice AS Bopanna issued the notice on the PIL filed by the Advocates Association of India (AAI)."}
{"ID": "id_859", "Summary": "The petitioner, Amitesh Banerjee, had moved the High Court alleging that the deceased was murdered by the Bagnan Police on February 19, 2022."}
{"ID": "id_866", "Summary": "Whoever fraudulently accepts, receives or claims any property or any interest therein, knowing that he has no right or rightful claim to such property or interest, or practises any deception touching any right to any property, or interest therein; Whoever dishonestly or fraudulently conceals or removes any property of himself or any other person, or dishonestly assists in the concealment or removalthereof, or falsely releases any demand or claim to which he is entitled, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, orwith both."}
{"ID": "id_870", "Summary": "A division bench of Chief Justice of India (CJI) Sanjay Kishan Kaul and Justice BV Nagarathna passed the order on a plea filed by the NLSIU Bengaluru challenging the notice dated September 3, 2020 issued by it to the Consortium of National Law Universities (CLAT) to conduct the NLAT 2020."}
{"ID": "id_872", "Summary": "The Court also noted that the chargesheet was filed for offences under Section 420 IPC and Sections 7/8/9/12/13(2) read with Section 13(1)(d) of the PC Act"}
{"ID": "id_879", "Summary": "The JJB was directed to take into consideration the documents submitted by the petitioner and pass appropriate orders in accordance with law, having regard to the mandate of the juvenile justice (care and protection of children) Act, the order stated."}
{"ID": "id_899", "Summary": "A division bench of Chief Justice of India (CJI) Sanjay Kishan Kaul and Justice Sanjiv Khanna observed that the present case is under challenge before the Jharkhand High Court under Article 226 of the Constitution of India as well as Section 482 of the Criminal Procedure Code (CrPC)."}
{"ID": "id_900", "Summary": "The Allahabad High Court on Tuesday granted bail to a man accused of instigating a mob to set a vehicle on fire during a clash between two groups of Hindus and Muslims in Uttar Pradesh's Allahabad district in June last year."}
{"ID": "id_918", "Summary": "\"Considering the age of the petitioner, the trauma she has suffered because of the sexual abuse and the agony she is going through at present and above all the report of the Me dical Board constituted by this Court, we think it appropriate that termination of pregnancy should be allowed."}
{"ID": "id_919", "Summary": "The Court said that transfer of investigation is not to be directed by the Court just for the asking nor the same is transferred only to satisfy the ego or vindicate the prestige of a party interested in such investig ation, but the decision whether transfer should or should not be o rdered The Chhattisgarh High Court on Monday refused to transfer an investigation from the State Investigating Agency (SIA) to any other independent agency like the Central Bureau of Investigation (CBI) in a kidnapping case."}
{"ID": "id_944", "Summary": "The Bombay High Court recently directed the Mumbai Municipal Corporation (M.C.G.M) to file an affidavit in support of its decision to demolish a building constructed without permission of the M.R.T.P Act. A division bench of Justices Abhay Oka and Ashutosh Deshmukh passed the order while hearing an appeal filed by the appellants challenging the order of the City Civil Court (CCL) which had ordered the demolition of the building on December 19, 2020."}
{"ID": "id_965", "Summary": "A Bench of Chief Justice of India (CJI) Sanjiv Khanna and Justice Sanjay Kishan Kaul held that the National Tiger Conservation Authority (NTCA) is required to lay down normative standards for tourism activities and guidelines for project tiger reserves from time to time for tiger conservation in the buffer and core area of tiger reserves and ensure their due compliance."}
{"ID": "id_978", "Summary": "The appellant was found guilty of rape and murder and sentenced to death by a sessions court in Dindori district of Maharashtra."}
{"ID": "id_99", "Summary": "The High Court was informed that the defendants had been using the mark MANAT since 2008 and that the plaintiffs had filed a suit against them for trademark infringement in December 2023."}
{"ID": "id_991", "Summary": "The Bombay High Court recently held that the wife's allegation that her husband is having an illicit relationship with a lady by the name of the child is nothing but an act of mental cruelty and the Family Court failed to take note of this particul ar fact and has erroneously dismissed the husband's petition."}
